[
  {
    "img": "/img/proyectos/jac1.png",
    "titulo": "JAC México",
    "tipo": "Plataforma web - [SSR-SSG]",
    "desc": "E-commerce a nivel nacional con alimentación de contenido por CMS y backend. Personalización por micrositio. Integración pasarelas de pago",
    "keyname": "jac.mx",
    "privado": false,
    "tecnologias": [
      "Vue.js",
      "Nuxt",
      "Vuetify 2",
      "Sendgrid"
    ],
    "notas": [
      "Carga de contenído dinámico vía CMS",
      "Personalización de micrositios según subdominio y validación de backend",
      "Funcionamiento en paralelo con la versión legacy, a través de discriminación por ruta en el proxy. Transparente para el usuario",
      "Manejo de catálogo y funcionamiento para ordenes de apartado, enganche y vento por backend, a través de API rest"
    ],
    "url": "https://jac.mx"
  },
  {
    "img": "/img/proyectos/sigo.png",
    "titulo": "Sigo",
    "tipo": "Sitio web - [SSR-SSG]",
    "desc": "Landing Page y area de Blog, creada de manera súbita y temporal para manejo de leads previo al despliege de la plataforma estípulada (vtex)",
    "keyname": "sigo",
    "privado": false,
    "tecnologias": [
      "Vue.js",
      "Nuxt",
      "Vuetify 2",
      "Strapi"
    ],
    "notas": [
      "Conectado a un servicio de CMS (Strapi).",
      "Carga de artículos para el blog de manera dinámica",
      "Registro de leads con verificación vía OTP (código al correo electrónico)",
      "Se adaptó contenido creado por algorítmo externo para detección de vehículo y obtención de su precio"
    ],
    "url": "https://www.sigosobreruedas.com/"
  },
  {
    "img": "/img/proyectos/plastomex.png",
    "titulo": "Plastomex",
    "tipo": "Sitio web - [SPA]",
    "desc": "Sitio web de tipo Single Page Aplication (SPA) para la empresa Plastomex, con BackEnd de email",
    "keyname": "plastomex",
    "privado": false,
    "tecnologias": [
      "Vue.js",
      "Vue Router",
      "Webpack",
      "Imagenes en WebP con fallback a png/jpg",
      "Imagenes con Lazyload en imágenes",
      "Animaciones CSS con IntersectionObserver",
      "Nodemailer",
      "Modernizr",
      "SPF",
      "Jivochat"
    ],
    "notas": [
      "Tienen un BackEnd desvinculado, corriendo un servicio de Nodemailer, lo que permite un servicios de correo electronicos personalizado y gratuito. Actualmente solo funciona para el correo interno (contacto y apliaciones a la bolsa de trabajo), pero puede adaptarse para una campaña de email marketing.",
      "El servicio de correo tiene protección CORS y un certificado SPF, el cual garantiza que el correo no será catalogado como spam",
      "Este sitio puede actualizarse facilmente gracias a que tanto los productos como las imagenes de la galería se obtienen através de un objeto JSON, el cual puede modificarse facilmente sin tener que modificar el código del sitio web",
      "Tiene la fluides de una SPA, pero también tienen los beneficios SEO de un sitio html normal, gracias a que está prerrenderizada"
    ],
    "url": "https://plastomex.com"
  },
  {
    "img": "/img/proyectos/jefferson.png",
    "titulo": "Intituto Jefferson Morelia",
    "tipo": "Sitio web",
    "desc": "Sitio web precompilado en Nunjucks, con alimentación de información por enlaces esxternos y JSON",
    "keyname": "ijm",
    "privado": false,
    "tecnologias": [
      "Nunjucks.js",
      "Gulp",
      "Imagenes en WebP con fallback a png/jpg",
      "Lazyload en imágenes",
      "Modernizr",
      "Cloudflare CDN"
    ],
    "notas": [
      "Al ser un sitio web precompilado, se reduce el trabajo del navegador en el cliente.",
      "Los calendarios y contadores se actualizan automaticamente",
      "Conexión con blog externo para la sección de noticias",
      "Puntuación de 99 en ordenador y 85 en móvil, tiempo de carga en <1 segundo"
    ],
    "url": "https://ijm.edu.mx"
  },
  {
    "img": "/img/proyectos/avopelle.png",
    "titulo": "Avopelle",
    "tipo": "E-commerce",
    "desc": "E-commerce autoadministrable por el cms Wordpress y WooCommerce, con trabajo de optimización de rendimiento. Además de configuración de correos por SMTP",
    "keyname": "avopelle",
    "privado": false,
    "tecnologias": [
      "Wordpress",
      "Woocomerce",
      "Hosting con Plesk",
      "Imagenes en WebP con fallback a png/jpg",
      "LiteSpeed Server",
      "LiteSpeed Plugin",
      "Pasarela de pago Openpay",
      "SMTP mailing",
      "Cloudflare CDN"
    ],
    "notas": [
      "(Deprecado por cliente)",
      "Está configurado para con el template y plugins actualizados automáticamente, dando un beneficio en cuestión de rendimiento",
      "La optimización realizada es tal que anteriormente cargama en un promedio de 9 segundos, siendo el tiempo actual de maximo 3 segundos en promedio"
    ],
    "url": "https://avopelle.com.mx"
  },
  {
    "img": "/img/proyectos/lcconsultoria.png",
    "titulo": "LC Consultoría",
    "tipo": "Landing Page",
    "desc": "Página web tipo landing, para generar presencia web a la empresa, exponer sus obras y proporcionar medios de contactos [Aún en desarrollo]",
    "keyname": "lc",
    "privado": false,
    "notas": [
      "(Deprecado por cliente)"
    ],
    "url": "https://beta.lcconsultoria.com"
  },
  {
    "img": "/img/proyectos/plataforma1.png",
    "titulo": "Plataforma Interna",
    "tipo": "Plataforma de administración interna para una agencia ",
    "desc": "Es una plataforma divididad en Front-End (dashboard) y Back-End (cms). Autoadministrable y configurable según las necesidades de la agencia. Realizada con software OpenSource ",
    "keyname": "dashboard-clout",
    "privado": true,
    "tecnologias": [
      "Strapi.js",
      "Vue.js",
      "Vue Router",
      "Vuex",
      "Bootstrap 4"
    ],
    "notas": [
      "Esta plataforma tiene el Front-End y Back-End desvinculados, gracias a las caracteristicas de usar un headless CMS como lo es Strapi.js",
      "El panel de administración del Back-End, cuenta con una interfaz gráfica, en donde se pueden agregar los elementos e incluso subir archivos fácilmente, para el uso de personal ajeno al desarrollo",
      "El dashboard utiliza Vue.js, un framework reactivo, por lo que si se desea, se pueden implementar websockets para poder ver reflejados los cambios en tiempo real sin necesidad de recargar la página",
      "Una vez configurada las vistas (páginas), el escalado horizontal (agregar nuevos clientes, nuevos posteos, nuevas imagenes) no es ningún problema y podrá hacerlo alguien no especializado"
    ]
  },
  {
    "img": "/img/proyectos/dashboard.png",
    "imgs": [
      "/img/proyectos/menu.png",
      "/img/proyectos/vuelidate.png"
    ],
    "titulo": "Plataforma Magna",
    "tipo": "Plataforma de administración interna para empresa",
    "desc": "Es una plataforma tipo SPA (Single Page Application) con posibilidad a fungir como PWA (Progresive Web Application) una vez configurado el service worker. Es una plataforma serverless ya que al tener Firebase como BaaS (Backed as a service), toda la funcionalidad requeridad por un servidor se proporciona a traves de APIs, dando una gran versatilidad al sitio",
    "keyname": "dashboard-magna",
    "privado": true,
    "tecnologias": [
      "Vue.js",
      "Vuex",
      "Vue Router",
      "Firebase: Cloud Firestore",
      "Firebase: Authentication",
      "Firebase: Analytics",
      "Firebase: Hosting",
      "Vuelidate",
      "Vuefire y Vuexfire",
      "Vuetify"
    ],
    "notas": [
      "Plataforma Front-End estática con Back-End desvinculado, mediante conexiones a la API REST",
      "El dashboard utiliza Vue.js, un framework reactivo, haciendo una gran sinergia con las APIs en tiempo real de Cloud Firestore ya que los cambios se puden visualizar en sin tener que recargar el sitio o repetir consultas.",
      "Debido a que Firestore tiene una tarifa por numero de documentos leidos/escritos, se implementó VUEX para un manejo de información del usuario de manera global entre los componenetes así redundacia en la base de datos para un optimización en las escrituras/lecturas así como mejora en la interfaz de usuario.",
      "Al haber configurado las vistas para cada nivel jerarquico, el aumento en el numero de usuarios no es ningún problema, e incluso es una operación que puede realizar un mismo usuario dentro de la plataforma",
      "Las vistas mostradas son del usuario de prueba, debido a la privacidad de la empresa."
    ],
    "url": "https://magnamultinivel.firebaseapp.com/"
  }
]